create table board(
	id		int auto_increment primary key,
    title	varchar(100),
    pname	varchar(100),
    pw		varchar(100),
	upfile	varchar(100),
    content varchar(9999),
    reg_date timestamp,
    cnt int,
    seq int,
    lev int,
    gid int
);

insert into board(id,title,pname,pw,content,reg_date,cnt,seq,lev,gid)
values
(0,'영글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,0),
(1,'첫글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,1),
(2,'두글이다','원빈','1111','두글내용','2023-06-07',0,0,0,2),
(3,'세글이다','투빈','1111','세글내용','2023-06-10',0,0,0,3),
(4,'네글이다','골빈','1111','네글내용','2023-06-12',0,0,0,4),
(5,'오글이다','장희빈','1111','오글내용','2023-06-19',0,0,0,5),
(6,'육글이다','원빈','1111','두글내용','2023-06-07',0,0,0,6),
(7,'칠글이다','투빈','1111','세글내용','2023-06-10',0,0,0,7),
(8,'팔글이다','골빈','1111','네글내용','2023-06-12',0,0,0,8),
(9,'구글이다','장희빈','1111','오글내용','2023-06-17',0,0,0,9);

insert into board(id,title,pname,pw,content,reg_date,cnt,seq,lev,gid)
values
(28,'영글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,28),
(29,'첫글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,29);

insert into board(id,title,pname,pw,content,reg_date,cnt,seq,lev,gid)
values
(30,'영글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,30),
(31,'첫글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,31),
(32,'두글이다','원빈','1111','두글내용','2023-06-07',0,0,0,32),
(33,'세글이다','투빈','1111','세글내용','2023-06-10',0,0,0,33),
(34,'네글이다','골빈','1111','네글내용','2023-06-12',0,0,0,34),
(35,'오글이다','장희빈','1111','오글내용','2023-06-19',0,0,0,35),
(36,'육글이다','원빈','1111','두글내용','2023-06-07',0,0,0,36),
(37,'칠글이다','투빈','1111','세글내용','2023-06-10',0,0,0,37),
(38,'팔글이다','골빈','1111','네글내용','2023-06-12',0,0,0,38),
(39,'구글이다','장희빈','1111','오글내용','2023-06-17',0,0,0,39);

insert into board(id,title,pname,pw,content,reg_date,cnt,seq,lev,gid)
values
(40,'영글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,40),
(41,'첫글이다','현빈','1111','첫글내용','2023-06-05',0,0,0,41),
(42,'두글이다','원빈','1111','두글내용','2023-06-07',0,0,0,42),
(43,'세글이다','투빈','1111','세글내용','2023-06-10',0,0,0,43),
(44,'네글이다','골빈','1111','네글내용','2023-06-12',0,0,0,44),
(45,'오글이다','장희빈','1111','오글내용','2023-06-19',0,0,0,45),
(46,'육글이다','원빈','1111','두글내용','2023-06-07',0,0,0,46),
(47,'칠글이다','투빈','1111','세글내용','2023-06-10',0,0,0,47),
(48,'팔글이다','골빈','1111','네글내용','2023-06-12',0,0,0,48),
(49,'구글이다','장희빈','1111','오글내용','2023-06-17',0,0,0,49);

select * from board;

select * from board where id = 22 and pw = "ㅎㅎ";